cfe llm/Enums/AI_ВидДействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>AI_ВидДействия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТолькоПоказать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполнитьФорму</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписатьОбъект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПользовательскоеДействие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийОбработчик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfe llm/Enums/AI_ТипЗначенияПоля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>AI_ТипЗначенияПоля</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Строка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Число</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Булево</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ссылка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfe llm/Catalogs/AI_МестаЗапускаСценариев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_МестаЗапускаСценариев</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Сценарии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипМеста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеКоманды</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment /><Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
					<FillFromFillingValue>false</FillFromFillingValue>				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныйЗапрос</Name>
					<Comment /><Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
					<FillFromFillingValue>false</FillFromFillingValue>				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьНесколькоОбъектов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаИзвлечения</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.AI_КартыИзвлечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДействия</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.AI_ВидДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработчик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодПроверки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВыполнения</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.AI_РежимВыполнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Уточнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидУточнения</Name>
							<Type>
								<v8:Type>d5p1:EnumRef.AI_ВидУточнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсточникДанных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитСвязи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитПредставления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитСодержимого</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитИмениФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтборРеквизит</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтборЗначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПередаватьСодержимое</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсказка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтборыКонтекста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Type>
								<v8:Type>d5p1:EnumRef.AI_ВидСравненияОтбора</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыДействия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначения</Name>
							<Type>
								<v8:Type>d5p1:EnumRef.AI_ТипЗначенияПоля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСсылки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/CommonModules/AI_ПрименениеРекомендаций/Ext/Module.bsl
// Применение рекомендаций модели к прикладным данным.
//
// Что именно делать с результатом, решает не код помощника, а настройка:
// у места запуска есть вид действия. Встроенных видов три, четвертый —
// точка расширения для прикладных сценариев:
//
//   ТолькоПоказать           — ничего не делать, показать значения;
//   ЗаполнитьФорму           — вернуть план, форма подставит значения сама
//                              и оставит объект незаписанным;
//   ЗаписатьОбъект           — записать значения в объект в транзакции;
//   ПользовательскоеДействие — вызвать AI_ДействияПереопределяемый;
//   ВнешнийОбработчик        — выполнить внешнюю обработку из реестра БСП,
//                              то есть добавить действие без обновления
//                              конфигурации.
//
// Общая часть у всех видов — план: что и в какой реквизит можно положить.
// План строится по карте извлечения, которая перечитывается здесь заново,
// поэтому пути, пришедшие с клиента, ни на что не влияют.
//
// Табличные части и реквизиты через точку сознательно не поддержаны:
// в них нет однозначной строки. Такой путь отклоняется явно.

#Область ПрограммныйИнтерфейс

// Строит план применения, ничего не меняя.
//
// Значения — таблица с колонками Ключ и Значение: что предложила модель.
//
// Возвращает таблицу с колонками Ключ, Представление, ПутьРеквизита,
// Значение, Применимо, Причина.
Функция ПодготовитьПлан(МестоЗапуска, Контекст, Значения) Экспорт

	ПроверитьДоступностьМеста(МестоЗапуска);
	Возврат СформироватьПлан(МестоЗапуска, Контекст, Значения);

КонецФункции

// Выполняет действие, объявленное на месте запуска.
//
// Шаг, Состояние и ОтветПользователя поддерживают многошаговые действия:
// обработчик вправе не завершиться, а попросить уточнение у пользователя.
// Тогда он возвращает Продолжение, форма его показывает и зовет действие
// снова со следующим шагом. Состояние между шагами обработчик хранит сам —
// ядро только переносит его туда и обратно.
//
// Возвращает структуру:
//   ВидДействия  — что было сделано;
//   План         — массив структур ПутьРеквизита, Значение, Представление;
//                  для вида ЗаполнитьФорму это то, что должна подставить форма;
//   Обработано   — сколько строк применено на сервере (для ЗаполнитьФорму — 0);
//   Отклонено    — сколько строк не прошло проверку;
//   Ошибка       — текст отказа, если действие не выполнено;
//   Сообщения    — построчные причины отказов;
//   Продолжение  — описание следующего шага либо Неопределено. Вид шага —
//                  вид уточнения («Вопрос», «ВводСтроки», «ВыборИзВариантов»,
//                  «ВводЧисла», «ВводДаты», «Флаг») либо «ОжиданиеЗаписи»:
//                  последний ничего не спрашивает, а ждет, пока объект
//                  запишет человек, и только потом идет следующий шаг;
//   Состояние    — что обработчик просит вернуть ему на следующем шаге;
//   СледующееДействие — место запуска, которым обработчик предлагает продолжить,
//                  либо Неопределено. Структура: МестоЗапуска, Причина.
Функция ВыполнитьДействие(МестоЗапуска, Контекст, Значения,
		Шаг = 1, Состояние = Неопределено, ОтветПользователя = Неопределено) Экспорт

	Результат = Новый Структура(
		"ВидДействия,План,Обработано,Отклонено,Ошибка,Сообщения,Продолжение,Состояние,СледующееДействие",
		Неопределено, Новый Массив, 0, 0, "", Новый Массив, Неопределено, Состояние, Неопределено);

	ПроверитьДоступностьМеста(МестоЗапуска);
	ВидДействия = МестоЗапуска.ВидДействия;
	Результат.ВидДействия = ВидДействия;

	Виды = Перечисления.AI_ВидДействия;
	Если Не ЗначениеЗаполнено(ВидДействия) Или ВидДействия = Виды.ТолькоПоказать Тогда
		Результат.Ошибка = "Для этого действия применение результата не настроено.";
		Возврат Результат;
	КонецЕсли;

	План = СформироватьПлан(МестоЗапуска, Контекст, Значения);
	Пригодные = План.НайтиСтроки(Новый Структура("Применимо", Истина));
	Результат.Отклонено = План.Количество() - Пригодные.Количество();
	Для Каждого СтрокаПлана Из План Цикл
		Если Не СтрокаПлана.Применимо И ЗначениеЗаполнено(СтрокаПлана.Причина) Тогда
			Результат.Сообщения.Добавить(
				СтрокаПлана.Представление + ": " + СтрокаПлана.Причина);
		КонецЕсли;
	КонецЦикла;

	Если ВидДействия = Виды.ЗаполнитьФорму Тогда
		// Формы конкретной конфигурации подсистеме недоступны, поэтому
		// значения подставляет вызывающая форма, а здесь только план.
		Для Каждого СтрокаПлана Из Пригодные Цикл
			Результат.План.Добавить(Новый Структура("ПутьРеквизита,Значение,Представление",
				СтрокаПлана.ПутьРеквизита,
				СтрокаПлана.Значение,
				СтрокаПлана.Представление));
		КонецЦикла;
		Если Результат.План.Количество() = 0 Тогда
			Результат.Ошибка = "Нет значений, пригодных для заполнения формы.";
		КонецЕсли;
		Возврат Результат;
	КонецЕсли;

	Если ВидДействия = Виды.ЗаписатьОбъект Тогда
		ЗаписатьОбъект(МестоЗапуска, Контекст, Пригодные, Результат);
		Возврат Результат;
	КонецЕсли;

	Если ВидДействия = Виды.ПользовательскоеДействие Тогда
		ВыполнитьПользовательскоеДействие(
			МестоЗапуска, Контекст, План, Шаг, ОтветПользователя, Результат);
		Возврат Результат;
	КонецЕсли;

	Если ВидДействия = Виды.ВнешнийОбработчик Тогда
		ВыполнитьВнешнийОбработчик(
			МестоЗапуска, Контекст, План, Шаг, ОтветПользователя, Результат);
		Возврат Результат;
	КонецЕсли;

	Результат.Ошибка = "Вид действия не поддержан ядром: " + Строка(ВидДействия);
	Возврат Результат;

КонецФункции

// Проверяет, доступно ли действие, кодом внешней обработки.
//
// Декларативные отборы контекста остаются дешевым путем для простых условий.
// Этот вход — для сложных: этап показывает, где именно нас спрашивают, и
// один метод обработки обслуживает все точки проверки.
//
// Этап — "ВыборДействия" | "ПередШагом" | "ПередДействием".
//
// Возвращает структуру Доступно, Причина. Упавшая проверка не ломает помощника:
// она трактуется как отказ, а причина уходит в журнал.
Функция ПроверитьДоступность(МестоЗапуска, Контекст, Этап,
		План = Неопределено, Состояние = Неопределено) Экспорт

	Результат = Новый Структура("Доступно,Причина", Истина, "");

	Если Не ЗначениеЗаполнено(МестоЗапуска) Или МестоЗапуска.ПометкаУдаления Тогда
		Результат.Доступно = Ложь;
		Результат.Причина = "Место запуска недоступно.";
		Возврат Результат;
	КонецЕсли;

	ИмяОбработчика = СокрЛП(МестоЗапуска.Обработчик);
	ИмяМетода = СокрЛП(МестоЗапуска.МетодПроверки);
	ЕстьВнешняя = ЗначениеЗаполнено(ИмяОбработчика) И ЗначениеЗаполнено(ИмяМетода);

	Попытка
		ПараметрыВызова = ПараметрыВызоваОбработчика(МестоЗапуска, Контекст, План);
		ПараметрыВызова.Вставить("ЭтапПроверки", Строка(Этап));
		ПараметрыВызова.Вставить("Состояние", Состояние);
		ПараметрыВызова.Вставить("Доступно", Истина);
		ПараметрыВызова.Вставить("Причина", "");

		// Сначала конфигурация, потом внешняя обработка: запрет, объявленный
		// в конфигурации, внешней настройкой не снимается.
		AI_ДействияПереопределяемый.ПриПроверкеДоступности(ПараметрыВызова);
		Если ПараметрыВызова.Доступно И ЕстьВнешняя Тогда
			Обработка = ПодключитьОбработчик(ИмяОбработчика);
			ВызватьМетодОбработки(Обработка, ИмяМетода, ПараметрыВызова);
		КонецЕсли;
	Исключение
		// Отказ проверки не должен ломать список действий пользователю.
		Результат.Доступно = Ложь;
		Результат.Причина = "Проверка доступности не выполнена.";
		ЗаписьЖурналаРегистрации(
			"AI.ПрименениеРекомендаций",
			УровеньЖурналаРегистрации.Ошибка,
			,
			МестоЗапуска,
			СтрШаблон("Проверка «%1.%2» на этапе «%3» завершилась ошибкой: %4",
				ИмяОбработчика, ИмяМетода, Строка(Этап), ОписаниеОшибки()));
		Возврат Результат;
	КонецПопытки;

	Результат.Доступно = ПараметрыВызова.Доступно;
	Результат.Причина = Строка(ПараметрыВызова.Причина);
	Возврат Результат;

КонецФункции

// Методы, которые обработка предлагает для настройки места запуска.
//
// Перечислить экспортные методы платформенными средствами нельзя: метаданные
// не хранят состав модуля, рефлексии над BSL нет. Поэтому список берется из
// самоописания обработки — необязательной функции СведенияОДействияхLLM.
// Нет функции — возвращается пустая таблица, и настройщику остаются
// стандартные имена и ручной ввод.
//
// Возвращает таблицу Метод, Представление, Назначение, Описание, Параметры.
Функция ПолучитьМетодыОбработчика(ИмяОбработчика) Экспорт

	Методы = Новый ТаблицаЗначений;
	Методы.Колонки.Добавить("Метод", Новый ОписаниеТипов("Строка"));
	Методы.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Методы.Колонки.Добавить("Назначение", Новый ОписаниеТипов("Строка"));
	Методы.Колонки.Добавить("Описание", Новый ОписаниеТипов("Строка"));
	Методы.Колонки.Добавить("Параметры", Новый ОписаниеТипов("Строка"));

	Если Не ЗначениеЗаполнено(СокрЛП(ИмяОбработчика)) Тогда
		Возврат Методы;
	КонецЕсли;

	Попытка
		Обработка = ПодключитьОбработчик(СокрЛП(ИмяОбработчика));
		Объявленные = Обработка.СведенияОДействияхLLM();
	Исключение
		// Обработка не найдена либо не описывает себя — это не ошибка.
		Возврат Методы;
	КонецПопытки;

	Если ТипЗнч(Объявленные) <> Тип("ТаблицаЗначений") Тогда
		Возврат Методы;
	КонецЕсли;
	Для Каждого Строка Из Объявленные Цикл
		Новая = Методы.Добавить();
		ЗаполнитьЗначенияСвойств(Новая, Строка);
	КонецЦикла;
	Возврат Методы;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Право увидеть рекомендации и право их применить — одно и то же право
// на действие, поэтому доступ к агенту проверяется еще раз.
Процедура ПроверитьДоступностьМеста(МестоЗапуска)

	Если Не ЗначениеЗаполнено(МестоЗапуска) Или МестоЗапуска.ПометкаУдаления Тогда
		ВызватьИсключение "Место запуска недоступно.";
	КонецЕсли;

	РешениеОДоступе = AI_ДоступКАгентамСервер.ОпределитьДоступ(
		ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор,
		МестоЗапуска.Сценарий.Агент);
	Если Не РешениеОДоступе.Разрешен Тогда
		ВызватьИсключение "Нет доступа к агенту сценария: " + РешениеОДоступе.Причина;
	КонецЕсли;

КонецПроцедуры

// Запись идет под правами пользователя: привилегированный режим не включается,
// отказ в правах — штатный результат, а не ошибка ядра.
Процедура ЗаписатьОбъект(МестоЗапуска, Контекст, Пригодные, Результат)

	Если Пригодные.Количество() = 0 Тогда
		Результат.Ошибка = "Нет значений, пригодных к записи.";
		Возврат;
	КонецЕсли;

	Ссылка = AI_ИзвлечениеРеквизитов.ПолучитьОбъектПоКонтексту(Контекст);
	Если Ссылка = Неопределено Тогда
		Результат.Ошибка = "Не удалось определить объект для записи.";
		Возврат;
	КонецЕсли;

	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить(Контекст.ПолноеИмяМетаданных);
		ЭлементБлокировки.УстановитьЗначение("Ссылка", Ссылка);
		Блокировка.Заблокировать();

		Объект = Ссылка.ПолучитьОбъект();
		Если Объект = Неопределено Тогда
			ВызватьИсключение "Объект не найден или недоступен для изменения.";
		КонецЕсли;

		Для Каждого СтрокаПлана Из Пригодные Цикл
			Объект[СтрокаПлана.ПутьРеквизита] = СтрокаПлана.Значение;
			Результат.Обработано = Результат.Обработано + 1;
		КонецЦикла;

		Объект.Записать();

		// Прикладная логика конфигурации вправе переопределить записанное:
		// в Документообороте, например, Контрагент вычисляется из состава
		// сторон и сбрасывается при записи. Молча отчитаться «записано»
		// в таком случае — ввести пользователя в заблуждение.
		Для Каждого СтрокаПлана Из Пригодные Цикл
			Если Объект[СтрокаПлана.ПутьРеквизита] = СтрокаПлана.Значение Тогда
				Продолжить;
			КонецЕсли;
			Результат.Обработано = Результат.Обработано - 1;
			Результат.Отклонено = Результат.Отклонено + 1;
			Результат.Сообщения.Добавить(СтрокаПлана.Представление
				+ ": значение не сохранилось — конфигурация переопределила реквизит при записи.");
		КонецЦикла;

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Результат.Обработано = 0;
		Результат.Ошибка = "Не удалось записать объект: " + ОписаниеОшибки();
		ЗаписатьВЖурнал(МестоЗапуска, Ссылка, Результат, УровеньЖурналаРегистрации.Ошибка);
		Возврат;
	КонецПопытки;

	ЗаписатьВЖурнал(МестоЗапуска, Ссылка, Результат, УровеньЖурналаРегистрации.Информация);

КонецПроцедуры

// Точка расширения: прикладное действие сверх встроенных видов.
// Ключ действия из места запуска позволяет одному обработчику обслуживать
// несколько сценариев, не заводя под каждый свой вид.
Процедура ВыполнитьПользовательскоеДействие(МестоЗапуска, Контекст, План,
		Шаг, ОтветПользователя, Результат)

	ПараметрыВызова = ПараметрыВызоваОбработчика(МестоЗапуска, Контекст, План);
	ПараметрыВызова.Вставить("Шаг", Шаг);
	ПараметрыВызова.Вставить("Состояние", Результат.Состояние);
	ПараметрыВызова.Вставить("ОтветПользователя", ОтветПользователя);

	AI_ДействияПереопределяемый.ПриВыполненииДействия(ПараметрыВызова);

	ПринятьОтветОбработчика(
		МестоЗапуска,
		Контекст,
		ПараметрыВызова,
		Результат,
		СтрШаблон("Действие «%1» не реализовано в AI_ДействияПереопределяемый.",
			СокрЛП(МестоЗапуска.КлючДействия)));

КонецПроцедуры

// Действие, реализованное внешней обработкой из реестра БСП.
//
// Реестром владеет БСП: там права, версии, безопасный режим и администрирование.
// Исполнение же идет платформенными средствами, поэтому ядро не заимствует
// объекты БСП и не вызывает его общие модули: и то и другое сделало бы
// расширение незапускаемым в конфигурациях без БСП.
Процедура ВыполнитьВнешнийОбработчик(МестоЗапуска, Контекст, План,
		Шаг, ОтветПользователя, Результат)

	ИмяОбработчика = СокрЛП(МестоЗапуска.Обработчик);
	Если Не ЗначениеЗаполнено(ИмяОбработчика) Тогда
		Результат.Ошибка = "В месте запуска не указана обработка-обработчик действия.";
		Возврат;
	КонецЕсли;

	ИмяМетода = СокрЛП(МестоЗапуска.МетодДействия);
	Если Не ЗначениеЗаполнено(ИмяМетода) Тогда
		ИмяМетода = "ВыполнитьДействие";
	КонецЕсли;

	Попытка
		Обработка = ПодключитьОбработчик(ИмяОбработчика);
	Исключение
		Результат.Ошибка = ОписаниеОшибки();
		Возврат;
	КонецПопытки;

	ПараметрыВызова = ПараметрыВызоваОбработчика(МестоЗапуска, Контекст, План);
	ПараметрыВызова.Вставить("Шаг", Шаг);
	ПараметрыВызова.Вставить("Состояние", Результат.Состояние);
	ПараметрыВызова.Вставить("ОтветПользователя", ОтветПользователя);

	Попытка
		ВызватьМетодОбработки(Обработка, ИмяМетода, ПараметрыВызова);
	Исключение
		Результат.Ошибка = СтрШаблон("Обработчик «%1.%2» завершился с ошибкой: %3",
			ИмяОбработчика, ИмяМетода, ОписаниеОшибки());
		ЗаписатьВЖурнал(
			МестоЗапуска,
			AI_ИзвлечениеРеквизитов.ПолучитьОбъектПоКонтексту(Контекст),
			Результат,
			УровеньЖурналаРегистрации.Ошибка);
		Возврат;
	КонецПопытки;

	ПринятьОтветОбработчика(
		МестоЗапуска,
		Контекст,
		ПараметрыВызова,
		Результат,
		СтрШаблон("Обработчик «%1.%2» не взял действие «%3» в работу.",
			ИмяОбработчика, ИмяМетода, СокрЛП(МестоЗапуска.КлючДействия)));

КонецПроцедуры

// Единая структура вызова для всех обработчиков — и переопределяемого модуля,
// и внешней обработки. Сигнатура намеренно одна: собрать произвольный список
// аргументов в BSL нельзя без генерации кода, а дополнительные данные удобно
// передавать содержимым структуры.
Функция ПараметрыВызоваОбработчика(МестоЗапуска, Контекст, План)

	Параметры = Новый Структура;
	Параметры.Вставить("КлючДействия", СокрЛП(МестоЗапуска.КлючДействия));
	Параметры.Вставить("МестоЗапуска", МестоЗапуска);
	Параметры.Вставить("Контекст", Контекст);
	Параметры.Вставить("План", План);
	Параметры.Вставить("Дополнительные", ДополнительныеПараметры(МестоЗапуска));
	Параметры.Вставить("Количество", 0);
	Параметры.Вставить("Сообщения", Новый Массив);
	Параметры.Вставить("Обработано", Ложь);
	Параметры.Вставить("Продолжение", Неопределено);
	// Цепочка: обработчик вправе предложить следующее действие. Именно
	// предложить — запускать его молча нельзя, решение остается за человеком.
	Параметры.Вставить("СледующееДействие", Неопределено);
	Возврат Параметры;

КонецФункции

// Пользовательские параметры места запуска, приведенные к объявленным типам.
Функция ДополнительныеПараметры(МестоЗапуска)

	Значения = Новый Структура;
	Для Каждого Строка Из МестоЗапуска.ПараметрыДействия Цикл
		Имя = СокрЛП(Строка.Имя);
		Если Не ЗначениеЗаполнено(Имя) Тогда
			Продолжить;
		КонецЕсли;
		Значения.Вставить(Имя, ТипизированноеЗначение(Строка));
	КонецЦикла;
	Возврат Значения;

КонецФункции

Функция ТипизированноеЗначение(Строка)

	Текст = СокрЛП(Строка.Значение);
	Типы = Перечисления.AI_ТипЗначенияПоля;
	Вид = Строка.ТипЗначения;

	Если Вид = Типы.Число Тогда
		Попытка
			Возврат Число(СтрЗаменить(СтрЗаменить(Текст, " ", ""), ",", "."));
		Исключение
			Возврат 0;
		КонецПопытки;
	ИначеЕсли Вид = Типы.Дата Тогда
		Попытка
			Возврат Дата(СтрЗаменить(СтрЗаменить(Текст, "-", ""), ".", ""));
		Исключение
			Возврат '00010101';
		КонецПопытки;
	ИначеЕсли Вид = Типы.Булево Тогда
		Возврат ВРег(Текст) = "ИСТИНА" Или Текст = "1" Или ВРег(Текст) = "ДА";
	ИначеЕсли Вид = Типы.Ссылка Тогда
		// Ссылочный параметр ищется по наименованию в объявленном типе:
		// хранить ссылку строкой безопаснее, чем привязывать настройку
		// подсистемы к составу типов конкретной конфигурации.
		Возврат СсылкаПоНаименованию(СокрЛП(Строка.ТипСсылки), Текст);
	КонецЕсли;

	Возврат Текст;

КонецФункции

Функция СсылкаПоНаименованию(ПолноеИмя, Текст)

	Если Не ЗначениеЗаполнено(ПолноеИмя) Или Не ЗначениеЗаполнено(Текст) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Попытка
		Менеджер = AI_ИзвлечениеРеквизитов.МенеджерПоПолномуИмени(ПолноеИмя);
		Возврат Менеджер.НайтиПоНаименованию(Текст, Истина);
	Исключение
		Возврат Неопределено;
	КонецПопытки;

КонецФункции

// Разбирает то, что вернул обработчик: продолжение диалога либо завершение.
Процедура ПринятьОтветОбработчика(МестоЗапуска, Контекст, ПараметрыВызова,
		Результат, ТекстОтказа)

	Для Каждого Сообщение Из ПараметрыВызова.Сообщения Цикл
		Результат.Сообщения.Добавить(Строка(Сообщение));
	КонецЦикла;

	Если ПараметрыВызова.Продолжение <> Неопределено Тогда
		// Обработчик просит уточнение у пользователя. Состояние он хранит сам,
		// ядро только переносит его между шагами.
		Результат.Продолжение = ПараметрыВызова.Продолжение;
		Результат.Состояние = ПараметрыВызова.Состояние;
		Результат.Обработано = ПараметрыВызова.Количество;
		Возврат;
	КонецЕсли;

	ПринятьСледующееДействие(МестоЗапуска, ПараметрыВызова, Результат);

	Если Не ПараметрыВызова.Обработано Тогда
		Результат.Ошибка = ТекстОтказа;
		Возврат;
	КонецЕсли;

	Результат.Обработано = ПараметрыВызова.Количество;
	Результат.Состояние = Неопределено;
	ЗаписатьВЖурнал(
		МестоЗапуска,
		AI_ИзвлечениеРеквизитов.ПолучитьОбъектПоКонтексту(Контекст),
		Результат,
		УровеньЖурналаРегистрации.Информация);

КонецПроцедуры

// Проверяет предложенное продолжение цепочки.
//
// Цепочка не должна превращаться в способ дотянуться до действия, которое
// пользователю не разрешено: место запуска проверяется теми же правилами, что и
// при обычном выборе, — активностью, доступом к агенту и отборами контекста.
// Непрошедшее предложение не молчит: причина уходит пользователю сообщением.
Процедура ПринятьСледующееДействие(МестоЗапуска, ПараметрыВызова, Результат)

	Предложение = ПараметрыВызова.СледующееДействие;
	Если Предложение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ТипЗнч(Предложение) <> Тип("Структура") Тогда
		Результат.Сообщения.Добавить(
			"Обработчик предложил продолжение в непонятном виде — оно пропущено.");
		Возврат;
	КонецЕсли;

	ИмяИлиСсылка = Неопределено;
	Предложение.Свойство("МестоЗапуска", ИмяИлиСсылка);
	Причина = "";
	Предложение.Свойство("Причина", Причина);

	Следующее = НайтиМестоЗапуска(ИмяИлиСсылка);
	Если Следующее = Неопределено Тогда
		Результат.Сообщения.Добавить(СтрШаблон(
			"Обработчик предложил продолжить действием «%1», но такого места запуска нет.",
			Строка(ИмяИлиСсылка)));
		Возврат;
	КонецЕсли;

	Если Следующее = МестоЗапуска Тогда
		// Действие, предлагающее само себя, — это цикл. Один шаг цепочки он
		// не испортит, но повторять его помощнику незачем.
		Результат.Сообщения.Добавить(
			"Обработчик предложил продолжить тем же действием — предложение пропущено.");
		Возврат;
	КонецЕсли;

	Попытка
		ПроверитьДоступностьМеста(Следующее);
	Исключение
		Результат.Сообщения.Добавить(СтрШаблон(
			"Продолжение «%1» недоступно: %2", Строка(Следующее), ОписаниеОшибки()));
		Возврат;
	КонецПопытки;

	Результат.СледующееДействие = Новый Структура("МестоЗапуска,Причина,Представление",
		Следующее,
		СокрЛП(Строка(Причина)),
		СокрЛП(Строка(Следующее.ПредставлениеКоманды)));

КонецПроцедуры

Функция НайтиМестоЗапуска(Знач ИмяИлиСсылка)

	Если ТипЗнч(ИмяИлиСсылка) = Тип("СправочникСсылка.AI_МестаЗапускаСценариев") Тогда
		Возврат ?(ЗначениеЗаполнено(ИмяИлиСсылка), ИмяИлиСсылка, Неопределено);
	КонецЕсли;
	Имя = СокрЛП(Строка(ИмяИлиСсылка));
	Если Не ЗначениеЗаполнено(Имя) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Ссылка = Справочники.AI_МестаЗапускаСценариев.НайтиПоНаименованию(Имя, Истина);
	Возврат ?(ЗначениеЗаполнено(Ссылка), Ссылка, Неопределено);

КонецФункции

// Подключение обработки кэшируется на время серверного вызова: многошаговое
// действие и проверки иначе подключали бы один и тот же файл заново.
Функция ПодключитьОбработчик(ИмяОбработчика)

	Кэш = ПодключенныеОбработчики();
	Подключенная = Кэш.Получить(ИмяОбработчика);
	Если Подключенная <> Неопределено Тогда
		Возврат Подключенная;
	КонецЕсли;

	Регистрация = НайтиЗарегистрированнуюОбработку(ИмяОбработчика);
	Если Регистрация = Неопределено Тогда
		ВызватьИсключение СтрШаблон(
			"Обработчик «%1» не найден. Проверьте, что дополнительная обработка"
			+ " зарегистрирована, опубликована и доступна текущему пользователю,"
			+ " а в конфигурации есть подсистема дополнительных обработок.",
			ИмяОбработчика);
	КонецЕсли;

	Попытка
		Адрес = ПоместитьВоВременноеХранилище(Регистрация.ДвоичныеДанные);
		// Предупреждения об опасных действиях в фоновом исполнении показать
		// некому, а блокировать выполнение они будут — гасим осознанно.
		Защита = Новый ОписаниеЗащитыОтОпасныхДействий;
		Защита.ПредупреждатьОбОпасныхДействиях = Ложь;
		ИмяПодключенной = ВнешниеОбработки.Подключить(
			Адрес, , Регистрация.БезопасныйРежим, Защита);
		Обработка = ВнешниеОбработки.Создать(ИмяПодключенной, Регистрация.БезопасныйРежим);
	Исключение
		ВызватьИсключение СтрШаблон("Не удалось подключить обработчик «%1»: %2",
			ИмяОбработчика, ОписаниеОшибки());
	КонецПопытки;

	Кэш.Вставить(ИмяОбработчика, Обработка);
	Возврат Обработка;

КонецФункции

Функция ПодключенныеОбработчики()
	Возврат AI_ПовторноеИспользование.КэшПодключенныхОбработчиков();
КонецФункции

// Вызывает метод обработки по имени из настройки.
//
// Вызвать метод по имени из переменной в BSL иначе нельзя: Объект[Имя] — это
// доступ к свойству, а не к методу. Поэтому здесь единственный Выполнить во
// всей подсистеме, и в него попадает не код, а идентификатор: имя метода
// проверяется по строгому шаблону до подстановки.
Процедура ВызватьМетодОбработки(Обработка, ИмяМетода, Параметры)

	ПроверитьИмяМетода(ИмяМетода);
	Выполнить("Обработка." + ИмяМетода + "(Параметры)");

КонецПроцедуры

Процедура ПроверитьИмяМетода(ИмяМетода)

	Если СтрДлина(ИмяМетода) = 0 Или СтрДлина(ИмяМетода) > 64 Тогда
		ВызватьИсключение "Имя метода обработчика пустое или слишком длинное.";
	КонецЕсли;

	Допустимые = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz"
		+ "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя"
		+ "0123456789_";
	Для Позиция = 1 По СтрДлина(ИмяМетода) Цикл
		Символ = Сред(ИмяМетода, Позиция, 1);
		Если СтрНайти(Допустимые, Символ) = 0 Тогда
			ВызватьИсключение СтрШаблон(
				"Недопустимое имя метода обработчика: «%1»."
				+ " Разрешены только буквы, цифры и подчеркивание.",
				ИмяМетода);
		КонецЕсли;
	КонецЦикла;

	Если СтрНайти("0123456789", Лев(ИмяМетода, 1)) > 0 Тогда
		ВызватьИсключение "Имя метода обработчика не может начинаться с цифры.";
	КонецЕсли;

КонецПроцедуры

// Читает регистрацию из справочника БСП. Текст запроса — данные, а не код,
// поэтому в конфигурации без БСП это не ошибка компиляции: запрос просто
// не выполнится, и вызывающий получит внятный отказ.
Функция НайтиЗарегистрированнуюОбработку(Имя)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Обработки.ХранилищеОбработки КАК ХранилищеОбработки,
		|	Обработки.БезопасныйРежим КАК БезопасныйРежим,
		|	Обработки.Версия КАК Версия
		|ИЗ
		|	Справочник.ДополнительныеОтчетыИОбработки КАК Обработки
		|ГДЕ
		|	НЕ Обработки.ПометкаУдаления
		|	И (Обработки.Наименование = &Имя ИЛИ Обработки.ИмяОбъекта = &Имя)
		|	И Обработки.Публикация <> ЗНАЧЕНИЕ(
		|		Перечисление.ВариантыПубликацииДополнительныхОтчетовИОбработок.Отключена)");
	Запрос.УстановитьПараметр("Имя", Имя);

	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
	Исключение
		// Нет подсистемы дополнительных обработок либо нет прав на справочник.
		Возврат Неопределено;
	КонецПопытки;

	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Хранилище = Выборка.ХранилищеОбработки;
	Если ТипЗнч(Хранилище) <> Тип("ХранилищеЗначения") Тогда
		Возврат Неопределено;
	КонецЕсли;
	ДвоичныеДанные = Хранилище.Получить();
	Если ТипЗнч(ДвоичныеДанные) <> Тип("ДвоичныеДанные") Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат Новый Структура("ДвоичныеДанные,БезопасныйРежим,Версия",
		ДвоичныеДанные,
		Выборка.БезопасныйРежим,
		Строка(Выборка.Версия));

КонецФункции

Функция СформироватьПлан(МестоЗапуска, Контекст, Значения)

	План = Новый ТаблицаЗначений;
	План.Колонки.Добавить("Ключ", Новый ОписаниеТипов("Строка"));
	План.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	План.Колонки.Добавить("ПутьРеквизита", Новый ОписаниеТипов("Строка"));
	План.Колонки.Добавить("Значение");
	План.Колонки.Добавить("Применимо", Новый ОписаниеТипов("Булево"));
	План.Колонки.Добавить("Причина", Новый ОписаниеТипов("Строка"));

	Если ТипЗнч(Значения) <> Тип("ТаблицаЗначений") Тогда
		Возврат План;
	КонецЕсли;

	// Белый список: карта перечитывается здесь, данные клиента не в счет.
	Карта = МестоЗапуска.КартаИзвлечения;
	ПоляКарты = Новый Соответствие;
	Если ЗначениеЗаполнено(Карта) И Не Карта.ПометкаУдаления И Карта.Активна Тогда
		Для Каждого Поле Из Карта.Поля Цикл
			Ключ = СокрЛП(Поле.Ключ);
			Если ЗначениеЗаполнено(Ключ) Тогда
				ПоляКарты.Вставить(Ключ, Поле);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	ОписаниеОбъекта = Метаданные.НайтиПоПолномуИмени(Строка(Контекст.ПолноеИмяМетаданных));

	Для Каждого СтрокаЗначения Из Значения Цикл
		СтрокаПлана = План.Добавить();
		СтрокаПлана.Ключ = СокрЛП(Строка(СтрокаЗначения.Ключ));
		СтрокаПлана.Значение = СтрокаЗначения.Значение;

		Поле = ПоляКарты.Получить(СтрокаПлана.Ключ);
		Если Поле = Неопределено Тогда
			СтрокаПлана.Причина = "Поле отсутствует в карте извлечения — применение запрещено.";
			Продолжить;
		КонецЕсли;

		СтрокаПлана.Представление = ?(ЗначениеЗаполнено(Поле.Представление),
			Поле.Представление, СтрокаПлана.Ключ);
		Путь = СокрЛП(Поле.ПутьРеквизита);
		СтрокаПлана.ПутьРеквизита = Путь;

		Если Не ЗначениеЗаполнено(Путь) Тогда
			СтрокаПлана.Причина = "В карте не задан реквизит объекта.";
			Продолжить;
		КонецЕсли;
		Если СтрНайти(Путь, ".") > 0 Тогда
			СтрокаПлана.Причина = "Применение к табличным частям и путям через точку не поддержано.";
			Продолжить;
		КонецЕсли;
		Если ОписаниеОбъекта = Неопределено Тогда
			СтрокаПлана.Причина = "Объект контекста не найден в конфигурации.";
			Продолжить;
		КонецЕсли;

		Реквизит = НайтиРеквизит(ОписаниеОбъекта, Путь);
		Если Реквизит = Неопределено Тогда
			СтрокаПлана.Причина = "Реквизит не найден: " + Путь;
			Продолжить;
		КонецЕсли;
		Если Не Реквизит.Тип.СодержитТип(ТипЗнч(СтрокаПлана.Значение)) Тогда
			СтрокаПлана.Причина = СтрШаблон(
				"Тип значения (%1) не подходит реквизиту %2.",
				Строка(ТипЗнч(СтрокаПлана.Значение)),
				Путь);
			Продолжить;
		КонецЕсли;

		СтрокаПлана.Применимо = Истина;
	КонецЦикла;

	Возврат План;

КонецФункции

// Реквизит объекта по имени, включая стандартные (Наименование, Код и прочие).
Функция НайтиРеквизит(ОписаниеОбъекта, Имя)

	Реквизит = ОписаниеОбъекта.Реквизиты.Найти(Имя);
	Если Реквизит <> Неопределено Тогда
		Возврат Реквизит;
	КонецЕсли;
	Попытка
		Для Каждого Стандартный Из ОписаниеОбъекта.СтандартныеРеквизиты Цикл
			Если Стандартный.Имя = Имя Тогда
				Возврат Стандартный;
			КонецЕсли;
		КонецЦикла;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	Возврат Неопределено;

КонецФункции

Процедура ЗаписатьВЖурнал(МестоЗапуска, Ссылка, Результат, Уровень)

	Текст = СтрШаблон(
		"Место запуска: %1. Вид действия: %2. Объект: %3. Применено: %4, отклонено: %5. %6",
		Строка(МестоЗапуска),
		Строка(Результат.ВидДействия),
		Строка(Ссылка),
		Результат.Обработано,
		Результат.Отклонено,
		Результат.Ошибка);
	ЗаписьЖурналаРегистрации("AI.ПрименениеРекомендаций", Уровень, , Ссылка, Текст);

КонецПроцедуры

#КонецОбласти
